docs/benchmark/runs/full-otel-saga-10rps-20260603022306/k6-output.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: docs/benchmark/runs/full-otel-saga-10rps-20260603022306/full-otel-saga-10rps.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m30s max duration (incl. graceful stop):
              * baseline_e2e_10rps: 10.00 iterations/s for 1m0s (maxVUs: 20-60, gracefulStop: 30s)


running (0m01.0s), 04/20 VUs, 6 complete and 0 interrupted iterations
baseline_e2e_10rps   [   2% ] 04/20 VUs  0m01.0s/1m0s  10.00 iters/s

running (0m02.0s), 03/20 VUs, 17 complete and 0 interrupted iterations
baseline_e2e_10rps   [   3% ] 03/20 VUs  0m02.0s/1m0s  10.00 iters/s

running (0m03.0s), 01/20 VUs, 29 complete and 0 interrupted iterations
baseline_e2e_10rps   [   5% ] 01/20 VUs  0m03.0s/1m0s  10.00 iters/s

running (0m04.0s), 02/20 VUs, 38 complete and 0 interrupted iterations
baseline_e2e_10rps   [   7% ] 02/20 VUs  0m04.0s/1m0s  10.00 iters/s

running (0m05.0s), 01/20 VUs, 49 complete and 0 interrupted iterations
baseline_e2e_10rps   [   8% ] 01/20 VUs  0m05.0s/1m0s  10.00 iters/s

running (0m06.0s), 02/20 VUs, 58 complete and 0 interrupted iterations
baseline_e2e_10rps   [  10% ] 02/20 VUs  0m06.0s/1m0s  10.00 iters/s

running (0m07.0s), 02/20 VUs, 68 complete and 0 interrupted iterations
baseline_e2e_10rps   [  12% ] 02/20 VUs  0m07.0s/1m0s  10.00 iters/s

running (0m08.0s), 01/20 VUs, 79 complete and 0 interrupted iterations
baseline_e2e_10rps   [  13% ] 01/20 VUs  0m08.0s/1m0s  10.00 iters/s

running (0m09.0s), 02/20 VUs, 88 complete and 0 interrupted iterations
baseline_e2e_10rps   [  15% ] 02/20 VUs  0m09.0s/1m0s  10.00 iters/s

running (0m10.0s), 01/20 VUs, 99 complete and 0 interrupted iterations
baseline_e2e_10rps   [  17% ] 01/20 VUs  0m10.0s/1m0s  10.00 iters/s

running (0m11.0s), 01/20 VUs, 109 complete and 0 interrupted iterations
baseline_e2e_10rps   [  18% ] 01/20 VUs  0m11.0s/1m0s  10.00 iters/s

running (0m12.0s), 02/20 VUs, 118 complete and 0 interrupted iterations
baseline_e2e_10rps   [  20% ] 02/20 VUs  0m12.0s/1m0s  10.00 iters/s

running (0m13.0s), 01/20 VUs, 129 complete and 0 interrupted iterations
baseline_e2e_10rps   [  22% ] 01/20 VUs  0m13.0s/1m0s  10.00 iters/s

running (0m14.0s), 01/20 VUs, 139 complete and 0 interrupted iterations
baseline_e2e_10rps   [  23% ] 01/20 VUs  0m14.0s/1m0s  10.00 iters/s

running (0m15.0s), 01/20 VUs, 149 complete and 0 interrupted iterations
baseline_e2e_10rps   [  25% ] 01/20 VUs  0m15.0s/1m0s  10.00 iters/s

running (0m16.0s), 02/20 VUs, 158 complete and 0 interrupted iterations
baseline_e2e_10rps   [  27% ] 02/20 VUs  0m16.0s/1m0s  10.00 iters/s

running (0m17.0s), 02/20 VUs, 168 complete and 0 interrupted iterations
baseline_e2e_10rps   [  28% ] 02/20 VUs  0m17.0s/1m0s  10.00 iters/s

running (0m18.0s), 02/20 VUs, 178 complete and 0 interrupted iterations
baseline_e2e_10rps   [  30% ] 02/20 VUs  0m18.0s/1m0s  10.00 iters/s

running (0m19.0s), 02/20 VUs, 188 complete and 0 interrupted iterations
baseline_e2e_10rps   [  32% ] 02/20 VUs  0m19.0s/1m0s  10.00 iters/s

running (0m20.0s), 02/20 VUs, 198 complete and 0 interrupted iterations
baseline_e2e_10rps   [  33% ] 02/20 VUs  0m20.0s/1m0s  10.00 iters/s

running (0m21.0s), 02/20 VUs, 208 complete and 0 interrupted iterations
baseline_e2e_10rps   [  35% ] 02/20 VUs  0m21.0s/1m0s  10.00 iters/s

running (0m22.0s), 02/20 VUs, 218 complete and 0 interrupted iterations
baseline_e2e_10rps   [  37% ] 02/20 VUs  0m22.0s/1m0s  10.00 iters/s

running (0m23.0s), 01/20 VUs, 229 complete and 0 interrupted iterations
baseline_e2e_10rps   [  38% ] 01/20 VUs  0m23.0s/1m0s  10.00 iters/s

running (0m24.0s), 01/20 VUs, 239 complete and 0 interrupted iterations
baseline_e2e_10rps   [  40% ] 01/20 VUs  0m24.0s/1m0s  10.00 iters/s

running (0m25.0s), 02/20 VUs, 248 complete and 0 interrupted iterations
baseline_e2e_10rps   [  42% ] 02/20 VUs  0m25.0s/1m0s  10.00 iters/s

running (0m26.0s), 02/20 VUs, 258 complete and 0 interrupted iterations
baseline_e2e_10rps   [  43% ] 02/20 VUs  0m26.0s/1m0s  10.00 iters/s

running (0m27.0s), 01/20 VUs, 269 complete and 0 interrupted iterations
baseline_e2e_10rps   [  45% ] 01/20 VUs  0m27.0s/1m0s  10.00 iters/s

running (0m28.0s), 02/20 VUs, 278 complete and 0 interrupted iterations
baseline_e2e_10rps   [  47% ] 02/20 VUs  0m28.0s/1m0s  10.00 iters/s

running (0m29.0s), 01/20 VUs, 289 complete and 0 interrupted iterations
baseline_e2e_10rps   [  48% ] 01/20 VUs  0m29.0s/1m0s  10.00 iters/s

running (0m30.0s), 01/20 VUs, 299 complete and 0 interrupted iterations
baseline_e2e_10rps   [  50% ] 01/20 VUs  0m30.0s/1m0s  10.00 iters/s

running (0m31.0s), 02/20 VUs, 308 complete and 0 interrupted iterations
baseline_e2e_10rps   [  52% ] 02/20 VUs  0m31.0s/1m0s  10.00 iters/s

running (0m32.0s), 01/20 VUs, 319 complete and 0 interrupted iterations
baseline_e2e_10rps   [  53% ] 01/20 VUs  0m32.0s/1m0s  10.00 iters/s

running (0m33.0s), 01/20 VUs, 329 complete and 0 interrupted iterations
baseline_e2e_10rps   [  55% ] 01/20 VUs  0m33.0s/1m0s  10.00 iters/s

running (0m34.0s), 01/20 VUs, 339 complete and 0 interrupted iterations
baseline_e2e_10rps   [  57% ] 01/20 VUs  0m34.0s/1m0s  10.00 iters/s

running (0m35.0s), 01/20 VUs, 349 complete and 0 interrupted iterations
baseline_e2e_10rps   [  58% ] 01/20 VUs  0m35.0s/1m0s  10.00 iters/s

running (0m36.0s), 01/20 VUs, 359 complete and 0 interrupted iterations
baseline_e2e_10rps   [  60% ] 01/20 VUs  0m36.0s/1m0s  10.00 iters/s

running (0m37.0s), 02/20 VUs, 368 complete and 0 interrupted iterations
baseline_e2e_10rps   [  62% ] 02/20 VUs  0m37.0s/1m0s  10.00 iters/s

running (0m38.0s), 01/20 VUs, 379 complete and 0 interrupted iterations
baseline_e2e_10rps   [  63% ] 01/20 VUs  0m38.0s/1m0s  10.00 iters/s

running (0m39.0s), 02/20 VUs, 388 complete and 0 interrupted iterations
baseline_e2e_10rps   [  65% ] 02/20 VUs  0m39.0s/1m0s  10.00 iters/s

running (0m40.0s), 01/20 VUs, 399 complete and 0 interrupted iterations
baseline_e2e_10rps   [  67% ] 01/20 VUs  0m40.0s/1m0s  10.00 iters/s

running (0m41.0s), 02/20 VUs, 408 complete and 0 interrupted iterations
baseline_e2e_10rps   [  68% ] 02/20 VUs  0m41.0s/1m0s  10.00 iters/s

running (0m42.0s), 01/20 VUs, 419 complete and 0 interrupted iterations
baseline_e2e_10rps   [  70% ] 01/20 VUs  0m42.0s/1m0s  10.00 iters/s

running (0m43.0s), 01/20 VUs, 429 complete and 0 interrupted iterations
baseline_e2e_10rps   [  72% ] 01/20 VUs  0m43.0s/1m0s  10.00 iters/s

running (0m44.0s), 02/20 VUs, 438 complete and 0 interrupted iterations
baseline_e2e_10rps   [  73% ] 02/20 VUs  0m44.0s/1m0s  10.00 iters/s

running (0m45.0s), 02/20 VUs, 448 complete and 0 interrupted iterations
baseline_e2e_10rps   [  75% ] 02/20 VUs  0m45.0s/1m0s  10.00 iters/s

running (0m46.0s), 02/20 VUs, 458 complete and 0 interrupted iterations
baseline_e2e_10rps   [  77% ] 02/20 VUs  0m46.0s/1m0s  10.00 iters/s

running (0m47.0s), 01/20 VUs, 469 complete and 0 interrupted iterations
baseline_e2e_10rps   [  78% ] 01/20 VUs  0m47.0s/1m0s  10.00 iters/s

running (0m48.0s), 01/20 VUs, 479 complete and 0 interrupted iterations
baseline_e2e_10rps   [  80% ] 01/20 VUs  0m48.0s/1m0s  10.00 iters/s

running (0m49.0s), 01/20 VUs, 489 complete and 0 interrupted iterations
baseline_e2e_10rps   [  82% ] 01/20 VUs  0m49.0s/1m0s  10.00 iters/s

running (0m50.0s), 02/20 VUs, 498 complete and 0 interrupted iterations
baseline_e2e_10rps   [  83% ] 02/20 VUs  0m50.0s/1m0s  10.00 iters/s

running (0m51.0s), 02/20 VUs, 508 complete and 0 interrupted iterations
baseline_e2e_10rps   [  85% ] 02/20 VUs  0m51.0s/1m0s  10.00 iters/s

running (0m52.0s), 02/20 VUs, 518 complete and 0 interrupted iterations
baseline_e2e_10rps   [  87% ] 02/20 VUs  0m52.0s/1m0s  10.00 iters/s

running (0m53.0s), 02/20 VUs, 528 complete and 0 interrupted iterations
baseline_e2e_10rps   [  88% ] 02/20 VUs  0m53.0s/1m0s  10.00 iters/s

running (0m54.0s), 02/20 VUs, 538 complete and 0 interrupted iterations
baseline_e2e_10rps   [  90% ] 02/20 VUs  0m54.0s/1m0s  10.00 iters/s

running (0m55.0s), 01/20 VUs, 549 complete and 0 interrupted iterations
baseline_e2e_10rps   [  92% ] 01/20 VUs  0m55.0s/1m0s  10.00 iters/s

running (0m56.0s), 02/20 VUs, 558 complete and 0 interrupted iterations
baseline_e2e_10rps   [  93% ] 02/20 VUs  0m56.0s/1m0s  10.00 iters/s

running (0m57.0s), 01/20 VUs, 569 complete and 0 interrupted iterations
baseline_e2e_10rps   [  95% ] 01/20 VUs  0m57.0s/1m0s  10.00 iters/s

running (0m58.0s), 01/20 VUs, 579 complete and 0 interrupted iterations
baseline_e2e_10rps   [  97% ] 01/20 VUs  0m58.0s/1m0s  10.00 iters/s

running (0m59.0s), 02/20 VUs, 588 complete and 0 interrupted iterations
baseline_e2e_10rps   [  98% ] 02/20 VUs  0m59.0s/1m0s  10.00 iters/s

running (1m00.0s), 01/20 VUs, 599 complete and 0 interrupted iterations
baseline_e2e_10rps   [ 100% ] 01/20 VUs  1m00.0s/1m0s  10.00 iters/s


  █ THRESHOLDS

    http_req_duration
    ✓ 'p(95)<1500' p(95)=115.31ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    unexpected_error_rate
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 600     9.98367/s
    checks_succeeded...: 100.00% 600 out of 600
    checks_failed......: 0.00%   0 out of 600

    ✓ order request accepted or rejected

    CUSTOM
    accepted_orders................: 600    9.98367/s
    unexpected_error_rate..........: 0.00%  0 out of 600

    HTTP
    http_req_duration..............: avg=103.93ms min=85.31ms  med=95.09ms  max=891.71ms p(90)=106.91ms p(95)=115.31ms
      { expected_response:true }...: avg=103.93ms min=85.31ms  med=95.09ms  max=891.71ms p(90)=106.91ms p(95)=115.31ms
    http_req_failed................: 0.00%  0 out of 600
    http_reqs......................: 600    9.98367/s

    EXECUTION
    iteration_duration.............: avg=204.68ms min=185.84ms med=195.91ms max=995.04ms p(90)=207.85ms p(95)=216.43ms
    iterations.....................: 600    9.98367/s
    vus............................: 1      min=1        max=4
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 466 kB 7.7 kB/s
    data_sent......................: 366 kB 6.1 kB/s



running (1m00.1s), 00/20 VUs, 600 complete and 0 interrupted iterations
baseline_e2e_10rps ✓ [ 100% ] 00/20 VUs  1m0s  10.00 iters/s